//-------------------Task-6------------------------
//Напишіть функцію calc(a, b, op), яка виконує над числами a і b
//одну із арифметичних операцій та повертає її результат. Вид операції
//визначається цілим числом op: 1 – віднімання, 2 – добуток, 3 – ділення,
//інші значення – додавання.

function calc(a, b, op) {
    switch (op) {
      case 1:
        return a - b;
      case 2:
        return a * b;
      case 3:
        if (b !== 0) {
          return a / b;
        } else {
          throw new Error("Ділення на нуль");
        }
      default:
        return a + b;
    }
  }
  console.log(calc(5, 0, 3));